// const navContent = {
//     job : {
//         title : '工作',
//         content : {
//             top : ['附近工作', '地區找工作', 'AI職涯顧問', '獵才顧問', '最新工作'],
//             bottom : ['轉職專區', '新鮮人專區', '學生打工實習', '身心障礙', '志工服務', '數位科技專區']
//         }
//     },
//     company : {
//         title : '公司',
//         content : ['推薦好公司', '上市櫃公司', '外商公司', '科技園區', '半導體公司']
//     },
//     tool : {
//         title : '工具',
//         content : {
//             top : ['履歷範本', '履歷診療室', '薪資情報', '公司評論', '職業適性測驗', '職業價值觀測驗'],
//             bottom : ['工作世界', '生涯興趣測驗', '升學就業地圖', '高中落點分析', '高中值學習歷程']
//         }
//     },
//     career : {
//         title : '職涯',
//         content : {
//             top : ['個人職涯分析', '職涯診所', '一對一諮詢', '職涯導航'],
//             bottom : ['課程中心', '證照中心', '職場力', 'Be A Giver']
//         }
//     },
//     app : {
//         title : 'APP',
//         content : ['104工作快找', '打工探吉']
//     },
//     services : {
//         title : '所有服務'
//     }
// }

const navContent = [
    {
        title : '工作',
        content : {
            top : {
                title : '多元管道',
                list : ['附近工作', '地區找工作', 'AI職涯顧問', '獵才顧問', '最新工作']
            },
            bottom : {
                title : '族群專屬',
                list : ['轉職專區', '新鮮人專區', '學生打工實習', '身心障礙', '志工服務', '數位科技專區']
            }
        }
    },
    {
        title : '公司',
        content : ['推薦好公司', '上市櫃公司', '外商公司', '科技園區', '半導體公司']
    },
    {
        title : '工具',
        content : {
            top : {
                title : '求職秘笈',
                list : ['履歷範本', '履歷診療室', '薪資情報', '公司評論', '職業適性測驗', '職業價值觀測驗']
            },
            bottom : {
                title : '探索與升學',
                list : ['工作世界', '生涯興趣測驗', '升學就業地圖', '高中落點分析', '高中值學習歷程']
            }
        }
    },
    {
        title : '職涯',
        content : {
            top : {
                title : '規劃與諮詢',
                list : ['個人職涯分析', '職涯診所', '一對一諮詢', '職涯導航']
            },
            bottom : {
                title : '學習與成長',
                list : ['課程中心', '證照中心', '職場力', 'Be A Giver']
            }
        }
    },
    {
        title : 'APP',
        content : ['104工作快找', '打工探吉']
    },
    {
        title : '所有服務'
    } 
]

export default navContent;